// Hints: তোমাকে একটি এরে এবং তার সাইজ দেওয়া হবে। এরে এর কোনো ভ্যেলু যদি নেগেটিভ হয় তাহলে সেখানে ২ বসিয়ে দিবে বা এসাইন করে দিবে। এরে এর কোনো ভ্যেলু যদি পজিটিভ হয় সেখানে ১ এসাইন করে দিবে। আর ০ হলে কিছু করার দরকার নেই, সেটা ০ ই থাকবে। লুপ চালিয়ে এরে এর প্রতিটি ভ্যেলুর উপর এই চেকিং চালিয়ে যদি নেগেটিভ পাও ঐ ইন্ডেক্স এ ২ এসাইন করে দিবে, পজিটিভ পেলে ঐ ইন্ডেক্স এ ১ এসাইন করে দিবে।
// A[index]=value এভাবে ভ্যেলু এসাইন করে কোনো ইন্ডেক্স এ।
// তারপর ঐ এরে প্রিন্ট করে দিবে। 

// Sample Input
// Sample Output
// 5
// 1 -2 0 3 4
// 1 2 0 1 1 

#include <stdio.h>
int main(){
    int n;
    scanf("%d", &n);
    int arr[n];
    for (int i = 0; i < n; i++)
    {
        scanf("%d", &arr[i]);
    }
    for (int i = 0; i < n; i++)
    {
        if(arr[i] > 0){
            arr[i] = 1;
        }
        else if(arr[i] < 0){
            arr[i] = 2;
        }
        printf("%d ", arr[i]);
    }
    
    
    return 0;
}